Revit 2027 API
ExternalFileUtils Methods
The ExternalFileUtils type exposes the following members.
Methods
Name | Description
GetAllExternalFileReferences |  Gets the ids of all elements which are external file references.
GetExternalFileReference |  Gets the external file referencing data for the given element.
GetFileBasedTempFolder |  Gets a temp folder based on the given file name
IsExternalFileReference |  Determines whether the given element represents an external file.
Top
See Also
Reference
ExternalFileUtils Class
Autodesk.Revit.DB Namespace